"""
도로들은 전투로 인해 트럭이나 탱크와 같은 차량들이 지날 갈 수 없다.
전투에서 승리하기 위해서는 기갑사단과 보급부대가 신속하게 이동하기 위한 도로가 있어야 한다.
공병대는 출발지(S) 에서 도착지(G)까지 가기 위한 도로 복구 작업을 빠른 시간 내에 수행하려고 한다.
도로가 파여진 깊이에 비례해서 복구 시간은 증가한다.
출발지에서 도착지까지 가는 경로 중에 복구 시간이 가장 짧은 경로에 대한 총 복구 시간을 구하시오.
깊이가 1이라면 복구에 드는 시간이 1이라고 가정한다.
이동 경로는 상하좌우 방향으로 진행할 수 있으며, 한 칸씩 움직일 수 있다.
지도 정보에는 각 칸마다 파여진 도로의 깊이가 주어진다.
현재 위치한 칸의 도로를 복구해야만 다른 곳으로 이동할 수 있다.
출발지에서 도착지까지 거리에 대해서는 고려할 필요가 없다.

출발지(S)와 도착지(G)는 좌상단과 우하단이 되고 입력 데이터에서는 0으로 표시된다.
출발지와 도착지를 제외한 곳이 0인 것은 복구 작업이 불필요한 곳이다.

[입력]
가장 첫 줄은 전체 테스트케이스의 수이다.
각 테스트 케이스마다 지도의 크기(N x N)가 주어진다. 지도의 크기는 최대 100 x 100이다.
그 다음줄 부터 지도의 크기만큼 2차원 배열 형태의 지도 정보가 주어진다.

[출력]
각 테스트 케이스의 답을 순서대로 출력하며, 각 케이스마다 줄의 시작에 “#C”를 출력하여야 한다.
이때 C는 케이스의 번호이다.
주어진 입력에서 출발지에서 도착지까지 가는 경로 중에 복구 작업에 드는 시간이 가장 작은 경로의 복구 시간을 출력하시오.

입력
10
4
0100
1110
1011
1010
6
011001
010100
010011
101001
010101
111010
8
출력
#1 2
#2 2
"""
from collections import deque
di = [1, 0, -1, 0]
dj = [0, 1, 0, -1]
for tc in range(int(input())):
    N = int(input())
    road = [list(map(int, list(input())))for _ in range(N)]
    cost = [[2000]*N for _ in range(N)]
    cost[0][0] = 0
    Q = deque([(0, 0)])
    while Q:
        i, j = Q.popleft()
        for d in range(4):
            ni = i + di[d]
            nj = j + dj[d]
            if 0 <= ni < N and 0 <= nj < N:
                need = cost[i][j] + road[ni][nj]
                if need < cost[ni][nj]:
                    cost[ni][nj] = need
                    Q.append((ni, nj))
    print(f'#{tc+1} {cost[-1][-1]}')
